Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: །གལ་ཏེ་འཇིག་རྟེན་པའི་མཆོག་སློང་བར་བྱེད་ན། དེ་ཐམས་ཅད་སྦྱིན་པར་བགྱིད་དེ།
en: If he requests the worldly boon, Noble Avalokiteśvara will grant it in full.

source: དོན་ཡོད་ཞགས་པའི་རྣམ་པར་ཐར་བའི་དཀྱིལ་འཁོར་ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོ་ཆེན་པོ་མཆོག་གི་སྒྲུབ་པའི་དངོས་གྲུབ་ཏུ་འགྱུར་རོ།
en: The vidyā holder will then obtain the ultimate success in the practices as taught in this great sovereign ritual, the maṇḍala of liberation of Amoghapāśa.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སྤྱན་སྔར་གྲུབ་པའི་དངོས་གྲུབ་ཇི་ལྟ་བ་དེ་བཞིན་དུ། རིག་སྔགས་འཆང་ལ་མཆོག་གི་དངོས་གྲུབ་འགྲུབ་པར་བགྱིད་དོ་ཞེས་བྱ་བའི་དངོས་གྲུབ་ཆེན་པོར་འགྱུར་རོ། །དངོས་གྲུབ་ཡངས་པར་ཡང་འགྱུར་རོ། །འཇིག་རྟེན་པའི་བྱ་བ་ཐམས་ཅད་ཀྱི་མཆོག་སྒྲུབ་པའི་དངོས་གྲུབ་ཏུ་འགྱུར་རོ། །གཞན་པའི་མཆོག་ཐམས་ཅད་མངོན་པར་བླངས་ན་སྩོལ་བར་བགྱིད་དེ།
en: He will attain the ultimate success, a great and vast accomplishment just as he requested in the presence of Noble Avalokiteśvara, and he will obtain supreme success in all worldly activities. “

source: འདི་ལྟ་སྟེ། སྔགས་ཀྱི་དངོས་གྲུབ་ཡང་མིག་འཕྲུལ་དང་། འོད་ཟེར་གྱི་དྲ་བ་དང་། ལྷའི་གཟུགས་མཐོང་བ་དང་།
en: Noble Avalokiteśvara will grant any worldly boons that the vidyā holder requests, such as the accomplishment of the mantra, the power to work magic, the power of prabhājāla, and the power to assume the form of a deva.

source: མི་སྣང་བ་དང་། ནམ་མཁའ་ལ་འགྲོ་བ་དང་། ཁུང་བུར་འཇུག་པ་དང་། ནགས་སུ་འཇུག་པ་དང་། ཀླུའི་གནས་སུ་འཇུག་པ་དང་།
en: He will grant the power to become invisible, travel through space, or to enter terrestrial passages, forests, the palaces of nāgas and kinnarīs, and the realms of water and space and to move underground.

source: མིའམ་ཅིའི་གནས་སུ་འཇུག་པ་དང་། ཆུ་ལ་འཇུག་པ་དང་། ནམ་མཁར་འཇུག་པ་དང་། ས་འོག་ཏུ་འཇུག་པ་དང་། ནོར་སྒྱུར་བ་སྨྲ་བ་དང་། ཞིང་དུ་སྨྲ་བ་དང་། ནོར་བུ་སྨྲ་བ་དང་། གཡུལ་ངོར་འཇུག་པ་དང་། འགུགས་པ་དང་། ཆར་འབེབས་པ་དང་།
en: He will confer the knowledge of alchemy, geology, archery, and how to survive a battle.

source: ཡང་དག་པར་འཛིན་པ་དང་། དབང་དུ་བྱེད་པ་དང་། གནོད་སྦྱིན་ཕྱིར་འབྱིན་པ་དང་། རྣམ་པར་གཡོ་བ་མེད་པར་བྱེད་པ་དང་། ཆུ་ཀླུང་ཆེན་པོ་སྒྲོལ་བ་དང་།
en: He will grant the power to summon beings, bring rain, stop excessive rain, enthrall beings, drive away yakṣas, remain unshakable, and cross broad rivers.

source: རྒྱུ་སྐར་སྨྲ་བ་དང་། སྔགས་སྨྲ་བ་དང་། རྫས་དང་། སྨན་གཡོ་བར་བྱེད་པ་དང་། བཅུད་ཀྱིས་ལེན་སྒྲུབ་པ་དང་། འཕོ་བར་བྱེད་པ་དང་། འབྱིན་པར་བྱེད་པ་དང་།
en: He will confer knowledge of the stars and of mantras, as well as the ability to extract medicinal substances, to produce the elixir of longevity, to transfer valuable objects and make them appear elsewhere, to obtain grain and clothes, and to enthrall a king.

source: ལོ་ཐོག་སྒྲུབ་པ་དང་། གོས་འདོར་བར་བྱེད་པ་དང་། རྒྱལ་པོ་དབང་དུ་བྱེད་པ་དང་། འཇིག་རྟེན་པའི་སྒྲུབ་པའི་དངོས་གྲུབ་དེ་ཐམས་ཅད་འགྲུབ་པར་བགྱིད་དོ། །དེ་ནས་འཇིག་རྟེན་པ་གཞན་དོན་དུ་གཉེར་ཅིང་འདོད་ན།
en: He will be able to successfully accomplish all these worldly practices. “

source: ཕྱག་གཡས་པ་སྤྱི་བོའི་གཙུག་ཏུ་འཇོག་པར་བྱེད་དེ།
en: If, however, the vidyā holder is concerned with the afterlife, Noble Avalokiteśvara will place his right hand on his head.

source: བཞག་པ་ཙམ་གྱི་མོད་ལ།
en: As soon as he does this, the vidyā holder will become free from the danger of untimely death.

source: ལུས་མེད་པ་དྲི་མ་དང་བྲལ་བ་ཡོངས་སུ་དག་པ་ཞེས་བྱ་བའི་ཡོངས་སུ་དག་པའི་ལུས་སོ་སོར་ཐོབ་སྟེ།
en: He will become immaculately pure, his body completely purified.

source: སྦྲུལ་གྱི་ཤུན་པ་བཞིན་དུ་ལུས་འདོར་བར་བགྱིད་དོ། །བསམས་པ་ཉིད་ཀྱི་མོད་ལ་དེ་མ་ཐག་ཁོ་ནར་བདེ་བ་ཅན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་འགྲོ་བར་བགྱིད་དོ།
en: At the time of death he will cast off his body as a snake does its skin, and he will instantaneously proceed to the realm of Sukhāvatī, as is his destiny.

source: །སྐྱེ་བ་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་གི་ཚེ་རབས་དྲན་པར་འགྱུར་རོ།
en: He will be able to recollect hundreds of thousands of millions of his former births, one after another.

source: །དེ་མ་ཐག་ཁོ་ནར་དེ་བཞིན་གཤེགས་པ་ཚེ་དཔག་ཏུ་མེད་པས་ལུང་བསྟན་པ་ཐོབ་པའི་མོད་ཉིད་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ།
en: He will obtain a prophecy from the Tathāgata Amitāyus about his future buddhahood, and he will never turn back until he attains unsurpassable perfect awakening.

source: །འདི་ཉིད་ནི་སྐྱེ་བར་སྐྱེས་པའི་ཐ་མའོ་ཞེས་སོ།
en: His current birth will be his last.

source: །སྒྲིབ་པ་ཐམས་ཅད་དང་བྲལ་བ་དོན་ཡོད་པ་རྣམ་པར་འཕྲུལ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་སོ་སོར་ཐོབ་ཅིང་། ཏིང་ངེ་འཛིན་གཞན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་ཐོབ་བོ།
en: He will attain the samādhi called magical amogha display following the removal of all obscurations and hundreds of thousands of millions of billions of other samādhis.

source: །ཕྱོགས་བཅུ་ཀུན་གྱི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་དགོངས་པར་འགྱུར་ཞིང་ལེགས་སོ་ཞེས་བྱ་བ་རྗེས་སུ་སྩོལ་བར་མཛད་དོ། །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་དགོངས་པར་འགྱུར་རོ།
en: All the tathāgatas throughout the ten directions will think of him and applaud him, and all the bodhisattvas will also think of him.

source: །ལྷ་ཐམས་ཅད་ཀྱིས་ཀྱང་འདི་ལ་ཀུན་ཏུ་སྲུང་བར་འགྱུར་རོ།
en: All the deities will protect him. “

source: །འཇིག་རྟེན་པ་དང་འཇིག་རྟེན་ལས་འདས་པའི་དངོས་གྲུབ་ཀྱི་མཆོག་གཉིས་པོ་འདི་ནི་མཐོང་བའི་ཆོས་ཉིད་ལ་རྗེས་སུ་སྩོལ་བར་འགྱུར་རོ། །བྱ་བ་གཞན་མང་ཞིང་ཆེས་མང་བ་ཐམས་ཅད་སྒྲུབ་པར་བགྱིད་དོ།
en: Noble Avalokiteśvara will grant the vidyā holder these two boons in this very life, with the corresponding success in worldly and supramundane matters. “

source: །གདོན་གྲོལ་བར་བྱེད་པ་དང་། འབེབས་པར་བྱེད་པ་དང་། མདོ་སྡེ་ལ་རྟོག་པ་དང་། ཚེ་ལ་རྟོག་པ་དང་། ནད་རབ་ཏུ་ཞི་བར་བྱེད་པ་དང་། འབྲ
en: The vidyā holder will also accomplish many other things, such as freedom from epilepsy and spirit possession, expert knowledge of the sūtras, medical knowledge, and assuagement of diseases.

source: ས་དང་། ཕོལ་མིག་དང་། ལྷོག་པ་དང་། མཚན་བར་རྡོལ་བ་དང་། རྐང་ཤུ་དང་། ཤ་བཀྲ་དང་། མཛེ་དང་། འབྲུམ་བུ་ཕྲ་མོ་དང་། གཡན་པ་དང་། མེ་དབལ་དང་། ལྟོ་བ་ན་བ་དང་། མིག་ན་བ་དང་། མགོ་བོ་ན་བ་དང་། གཞོགས་ཕྱེད་ན་བ་དང་། མ་རོ་ཙ་ཀ་དང་། ཕོ་བའི་ནད་དང་། སོ་ན་བ་དང་། མགུལ་པ་ན་བ་དང་། ལྕེ་དང་། རྐན་ན་བ་དང་། ཁ་ན་བ་དང་། སྣ་ན་བ་དང་། རྣ་བ་ན་བ་དང་། སྙིང་ན་བ་དང་། ལྟོ་བ་ན་བ་དང་། རྩིབ་ལོགས་ན་བ་དང་། ལག་པ་ན་བ་དང་། རྐང་པ་ན་བ་དང་། རྗེ་ངར་ན་བ་དང་། སེན་མོ་ན་བ་དང་། རིམས་ཉིན་གཅིག་པ་དང་། ཉིན་གཉིས་པ་དང་། ཉིན་གསུམ་པ་དང་། ཉིན་བཞི་པ་དང་། རྟག་པའི་རིམས་དང་། མཚན་མོ་པ་དང་། ཉིན་མོ་པ་དང་། འདུས་པ་སྟེ་འདི་དག་ཐམས་ཅད་གསང་སྔགས་འདི་བཟླས་པ་ཙམ་གྱིས་རྣམ་པར་ཉམས་པར་བགྱིད་དོ།
en: All ailments such as boils, blisters, festering abscesses, fistulas, scabs, spotted leprosy, lice, cutaneous eruptions, erysipelas, stomachache, pain in the eyes, headache, hemiplegia, indigestion, insufficiency of digestive juices, toothache, throat ache, pain of the tongue, pain of the palate, diseases of the mouth and nose, earache, pain in the chest, and abdominal pain; pains in the flanks, hands, feet, calves, or around the fingernails; and fevers including those that return every day or every two, three, or four days, and every other type of fever, whether it is a daytime or nighttime fever or a combination of fevers, will cease as soon as the mantra is mindfully recited.

source: །སྡིག་པ་དེ་རྣམས་རྣམ་པར་ཉམས་པར་བགྱིད་དོ། །གདུག་པ་ཐམས་ཅད་དང་། ཕྱིར་རྒོལ་བ་དང་། དགྲ་ཐམས་ཅད་རྣམ་པར་ཉམས་པར་བགྱིད་དོ།
en: All wrongdoings will likewise be purified, and all wicked beings, opponents, and adversaries will disappear.

source: །དེ་ལྟར་གཟུངས་ཀྱི་སྙིང་པོ་འདི་ནི་སྟོབས་ཆེན་པོ་དང་ལྡན་པས་ཏེ། འཇིག་རྟེན་པའི་དངོས་གྲུབ་ཀྱི་མཆོག་འདི་དག་འགྲུབ་པར་འགྱུར་རོ།
en: This heart dhāraṇī is therefore very powerful; it will bring supreme worldly accomplishments. “

source: །དེ་ནས་ལས་བྱེད་པར་འདོད་ན། དེའི་འོག་ཏུ་རིག་སྔགས་འཆང་གཙང་མ་གོས་གཙང་མ་བགོས་པ་ལེགས་པར་ཁྲུས་བྱས་པས་བགྱི་སྟེ།
en: If the vidyā holder wants to perform the dhāraṇī rite, he should be ritually pure, wear clean clothes, and be thoroughly bathed.

source: དེ་ནས་དོན་ཡོད་པ་ཆེན་པོའི་སྙིང་པོའི་གསང་སྔགས་ཀྱི་གཟུངས་འདི་སྒྲུབ་ཅིང་བཟླས་པས་དེ་དག་འགྲུབ་པར་འགྱུར་རོ། །སྟོང་ཕྲག་བཅོ་བརྒྱད་དུ་བཟླས་པས་སྡིག་པ་ཐམས་ཅད་ཞི་ཞིང་འཇིག་རྟེན་པའི་རིག་སྔགས་ཆེན་པོ་གྲུབ་པར་འགྱུར་རོ། །ཐམས་ཅད་ལ་ལུས་ཐམས་ཅད་དུ་སྒྲུབ་པར་བྱེད་དོ།
en: By completing the recitation of the great dhāraṇī, an amogha heart mantra, he will attain the following: after eighteen thousand recitations, all his negativity will be pacified, the worldly accomplishments produced by this great vidyā will be obtained, and he will succeed in all his endeavors. “

source: །དེ་ནས་འཇིག་རྟེན་ལས་འདས་པའི་བཟླས་པའི་ཆོ་ག་སྒྲུབ་པར་འདོད་པའི་རིག་སྔགས་འཆང་དེས་ཉི་མ་རེ་རེ་ཞིང་གཙང་མ་ལེགས་པར་ཁྲུས་བགྱིས་ཤིང་གོས་གཙང་མ་བགོས་པས་བགྱིས་ཏེ།
en: If, on the other hand, the vidyā holder wants to perform the recitation procedure in order to accomplish supramundane goals, he should, every day, maintain ritual purity, bathe thoroughly, and wear clean clothes.

source: ཉལ་ཚེས་གཅིག་ནས་བརྩམས་ཏེ། ཉི་མ་རེ་རེ་ཞིང་སྟོང་ཕྲག་བཅུར་བཟླས་པ་དབུལ་བར་བྱའོ།
en: Starting on the full moon day, he should recite the mantra one thousand and ten times every day.

source: །བཅུ་གཅིག་པའི་ཕྱོགས་ལ་ཚེས་གསུམ་གྱི་ཉིན་མཚན་ནས་བགྱི་སྟེ། ཉི་མ་རེ་རེ་ཞིང་སྟོང་ཕྲག་ཕྱེད་དང་གཉིས་བཟླས་པ་དབུལ་བར་བགྱིའོ། །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་མཆོད་པར་བགྱི། བཅོ་ལྔའི་ཉ་ལ་དཀར་གསུམ་གྱི་གཏོར་མ་དབུལ་བར་བགྱི། མཆོད་ཡོན་དང་ཞབས་བསིལ་དབུལ་བར་བགྱི།
en: On the eleventh day, and then over the next three days, he should practice day and night, reciting the mantra one thousand five hundred times every day and making offerings to Noble Avalokiteśvara.

source: དེ་ནས་ཟས་དཀར་གསུམ་བཟའ་བར་བགྱི་ཞིང་།
en: On the fifteenth day, the day of the full moon, he should offer a bali consisting of the three ‘white’ foods and argha water for the feet.

source: བཅོ་ལྔ་ཉའི་མཚན་མོ་སྟོང་རྩ་བརྒྱད་བཟླས་པ་དབུལ་བར་བགྱིའོ།
en: Subsisting on the three ‘white’ foods, he should recite the mantra one thousand and eight times on the night of the full moon. “

source: །ཐུན་ཐ་མ་ལ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་འོངས་ཏེ། རིག་སྔགས་འཆང་ལེགས་སོ་ཞེས་སྨྲ་བར་བགྱིད་ཅིང་།
en: Noble Avalokiteśvara will arrive during the last watch of that night and say to the vidyā holder, ‘Good!

source: ཁྱོད་ཀྱིས་དོན་ཡོད་རྒྱལ་པོའི་སྙིང་པོ་མཐའ་དག་ཡོངས་སུ་རྫོགས་པའི་ཆོ་ག་ཞིབ་མོ་དང་། རྣམ་པར་ཐར་པའི་དཀྱིལ་འཁོར་གྲུབ་བོ།
en: You have fully accomplished the entire rite, the heart essence of Amogharāja that constitutes a maṇḍala of liberation.’

source: །ཕྱག་གཡས་པ་བརྐྱང་ནས་པདྨ་སྩོལ་བར་བགྱིད་དེ།
en: He will then extend his right hand and give the vidyā holder a lotus.

source: རིག་སྔགས་འཆང་གིས་བླང་བར་བགྱིའོ། །བླངས་པ་ཙམ་གྱི་མོད་ལ། ནམ་མཁའ་ལ་རྫུ་འཕྲུལ་གྱིས་འགྲོ་ཞིང་། གང་དུ་འདོད་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་འགྲོའོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་ཡང་དག་པར་དབུགས་འབྱིན་པར་བགྱིད་དོ།
en: As soon as the vidyā holder grasps it, he will magically ascend into the sky and go to whatever buddha field he wants, where he will be comforted by all the tathāgatas. “

source: །དེ་ནས་སྦྱིན་སྲེག་གི་ཆོ་ག་བགྱིད་པར་འདོད་པས་པདྨའི་སྙིང་པོ་བཟའ་བར་བགྱི།
en: If the vidyā holder wants to perform a homa procedure, he should dig a perfectly circular lotus pond.

source: དཀྱིལ་འཁོར་གྱི་ཚད་ལ་པདྨའི་རྩ་བ་དང་། སྡོང་བུ་དང་། ལོ་མ་མར་དང་བསྲེས་པའི་སྦྱིན་སྲེག་བགྱིའོ།
en: Into it he should offer one thousand and eight lotus seat homas, which consist of lotus stalks and petals smeared with ghee.

source: །དྲི་ཞིམ་པོའི་ཤིང་ལ་མེ་སྦར་ལ་སྟོང་ཕྲག་བརྒྱད་དུ་སྦྱིན་སྲེག་བགྱིའོ།
en: To do this, he should build a fire using fragrant wood.

source: །སྟོང་ཕྲག་བརྒྱད་རྫོགས་པ་དང་། དཔལ་ལྷ་མོ་ཆེན་མོ་དངོས་སུ་འོངས་ཏེ།
en: When he has repeated the homa one thousand and eight times, the great goddess Śrī will arrive, appearing before the vidyā holder’s very eyes.

source: དེ་ལ་དྲི་ཞིམ་པོའི་མཆོད་ཡོན་ཕུལ་བས་རིག་སྔགས་འཆང་བགྱི་བ་ཅི་ཡོད་ཅེས་སྨྲ་བར་བགྱིད་དོ།
en: She should be given a welcome offering of perfumed argha water for the feet. “The goddess will say, ‘What can I do for you, vidyā holder?’

source: །དེས་བཅོམ་ལྡན་འདས་མ་བདག་ལ་ནོར་མི་ཟད་པ་རྙེད་པ་དང་།
en: to which he should reply, ‘Grant me inexhaustible wealth, O goddess!

source: གཏེར་རྙེད་པ་རབ་ཏུ་སྩོལ་ཅིག་ཅེས་བརྗོད་པར་བྱའོ།
en: Grant me a treasure trove!’ She will reply, ‘So it shall be!’

source: །དེ་ནས་ཁྱོད་ཀྱིས་དེ་བཞིན་བྱའོ་ཞེས་དབུགས་འབྱིན་པར་བྱེད་ཅིང་མི་སྣང་བར་འགྱུར་རོ།
en: Having thus reassured him, she will disappear.

source: །རིག་སྔགས་འཆང་གང་དང་གང་དུ་འགྲོ་བ་དེ་དང་དེར་གཏེར་ཆེན་པོ་མཐོང་སྟེ། ནམ་ཡང་ཟད་པར་ཉེ་བར་མི་འགྲོའོ།
en: Then, wherever the vidyā holder goes, he will discover great treasure, treasure that will never come close to being exhausted.

source: །སྦྱིན་པར་བགྱི། ལོངས་སྤྱད་པར་བགྱི། དཀོན་མཆོག་གསུམ་ལ་མཆོད་པར་བགྱི།
en: He should give some of it away, use some for himself, and offer some to the Three Jewels.

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་མཆོད་པར་བགྱི། དཔལ་ལྷ་མོ་ཆེན་མོ་ལ་ཉི་མ་རེ་རེ་ཞིང་སོ་སོའི་ཆ་ཤས་དབུལ་བར་བགྱིའོ། །ཨུཏྤ་ལ་སྔོན་པོ་དང་། ཙནྡན་གྱི་ཕྱེ་མ་དང་།
en: He should make offerings to Noble Avalokiteśvara and to the great goddess Śrī, offering part of the treasure every single day to either of them. “

source: མར་གསར་བསྲེས་པས་ཨརྒའི་ཤིང་ལ་མེ་སྦར་ཏེ།
en: The vidyā holder should light a fire using sticks of giant milkweed and offer, in front of the painting of Noble Avalokiteśvara, blue lotuses sprinkled with sandalwood powder and smeared with freshly churned butter.

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་རས་རིས་ཀྱི་མདུན་དུ་ཟླ་ཕྱེད་ཅིག་ཏུ་སྦྱིན་སྲེག་བགྱི་སྟེ།
en: He should continue with the offering for one fortnight, without counting the homas.

source: དཔག་ཏུ་མེད་པ་དབུལ་བར་བགྱིས་ན་རྫོགས་པ་ན་ལས་ཐམས་ཅད་ལ་ཀུན་ནས་ལོངས་སྤྱད་པ་ཐོབ་བོ།
en: When this rite is fully completed, he will obtain every type of enjoyment.

source: །རས་རིས་ཀྱི་མདུན་དུ་ཤིང་ཀུན་དང་། ཏིལ་མར་དང་། ཡུངས་ཀར་བསྲེས་ལ་པདྨའི་འདབ་མ་དང་། ཐང་ཤིང་གི་ཡམ་ཤིང་གིས་ཞག་བདུན་དུ་ཐུན་གསུམ་དུ་སྦྱིན་སྲེག་བརྒྱད་བརྒྱ་བྱས་ན་གྲོང་བརྒྱ་ཐོབ་བོ།
en: If he makes a fire of cedar wood in front of the painting and offers one hundred and eight homas of mustard seeds and lotus petals smeared with asafetida resin and sesame oil three times a day for seven days, he will obtain one hundred villages. “

source: །ཤིང་མྱ་ངན་མེད་པའི་ཡམ་ཤིང་མར་ལ་བཏགས་པས་ཟླ་ཕྱེད་ཅིག་ཏུ་ཐུག་གསུམ་དུ་སྦྱིན་སྲེག་བརྒྱད་བརྒྱ་བྱས་ན་རྒྱལ་པོ་ཉིད་ཐོབ་བོ།
en: If he offers one hundred and eight homas of aśoka sticks smeared with ghee three times a day for one fortnight, he will obtain a kingdom.

source: །མཚན་མོ་བདུན་དུ་ཐུན་གསུམ་དུ་ཡམ་ཤིང་གིས་སྦྱིན་སྲེག་བརྒྱད་བརྒྱ་བྱས་ན་གནས་ངེས་པར་བསྟན་པའི་ཆོ་ག་སྨྲ་བར་བྱེད་དོ།
en: If he offers the sticks one hundred and eight times three times a day for seven days, he will be able to reveal the places where instructions are given.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་གཟུགས་བརྙན་ལ་མཚན་མོ་བཅུ་གཉིས་སུ་མ་ལི་ཀའི་མེ་ཏོག་སྟོང་ཕྲག་བརྒྱད་ཀྱིས་མཆོད་པར་བྱ་སྟེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ལ་མངོན་པར་དད་པ་དང་། ལྷ་དང་། ཀླུ་རྣམས་མངོན་པར་དང་བར་འགྱུར་རོ།
en: If he offers one thousand and eight homas of jasmine flowers to the image of Noble Avalokiteśvara for twelve days, he will propitiate all the blessed buddhas as well as the gods and nāgas.

source: །མཆོག་ཐམས་ཅད་དང་བྱ་བ་ཐམས་ཅད་སྒྲུབ་པར་བྱེད་དོ།
en: He will then obtain every boon and accomplish all tasks. “

source: །ནོར་བུ་བཟང་པོ་སྤྱན་དྲང་བར་འདོད་པས་སྙིང་གར་མིང་མེད་ཀྱི་སོར་མོ་བཞག་ནས་ཐུན་གསུམ་དུ་བརྒྱད་བརྒྱ་བཟླས་པར་བྱ་སྟེ། མཚན་མོ་བཅུ་གཉིས་སུ་ལས་རྫོགས་པ་དང་།
en: If the vidyā holder wants to summon Maṇibhadra, he should place his ring finger against his heart and recite the mantra one hundred and eight times at the three junctions of the day for twelve days.

source: ནོར་བུ་བཟང་པོ་མཐོང་བ་སྩལ་བར་བྱེད་དོ།
en: When the rite is completed, Maṇibhadra will appear to him.

source: །སྙིང་གར་ཡོངས་སུ་བྱུགས་པ་ཙམ་གྱིས་ཉི་མ་རེ་རེ་ལ་དོང་ཚེ་བརྒྱ་སྩོལ་བར་བགྱིད་དེ། དེ་ཡང་ལྷག་མ་མེད་པར་ཟད་པར་བགྱི་སྟེ།
en: By merely touching the heart area with his finger, the vidyā holder will obtain one hundred dinars every single day.

source: ཡང་དང་ཡང་དུ་སྩོལ་བར་བགྱིད་དོ།
en: If this amount is spent entirely, Maṇibhadra will give more.

source: །གང་ཡིན་པ་དེ་དང་དེ་མ་བགྱིས་ན་ཕྱིས་སྩོལ་བར་མི་བགྱིད་དོ། །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་མངོན་དུ་ཕྱོགས་པར་འདུག་ནས་སམ།
en: Should the vidyā holder hoard any of it, no more will come. “

source: ཡང་ན་རིང་བསྲེལ་ཅན་གྱི་མཆོད་རྟེན་ནམ་རས་རིས་ལ་མངོན་དུ་ཕྱོགས་པར་གཞག་པར་བགྱིའོ། །སེང་ལྡེང་གི་ཡམ་ཤིང་ཞོ་དང་། སྦྲང་རྩི་དང་། མར་ལ་བཏགས་པས་ཐུན་གསུམ་དུ་བརྒྱད་བརྒྱར་སྦྱིན་སྲེག་བགྱི་སྟེ། ཉི་མ་བདུན་ཡོངས་སུ་རྫོགས་པ་ན།
en: Standing opposite an image of Noble Avalokiteśvara, a reliquary, or a painting facing west, the vidyā holder should offer one hundred and eight homas of cutch tree sticks, smeared with curds, honey, and ghee, at the three junctions of the day for seven days.

source: ཟོང་སྟོང་ཕྲག་བཅུ་ཐོབ་བོ།
en: When the rite is completed, he will obtain ten thousand rūpaka coins.

source: །དེ་ལྟ་བུ་ལ་སོགས་པའི་རྒྱས་པའི་ལས་རྣམས་ཐམས་ཅད་དུ་སྦྱར་བར་བགྱིའོ།
en: These and other enriching rites can be employed for any purpose. “

source: །དེ་ནས་མིག་སྨན་སྒྲུབ་པར་འདོད་པའི་རིག་སྔགས་འཆང་དེས་གཙང་མས་བསྒྲུབ་པར་བགྱི་སྟེ་ཁྲུས་བགྱིའོ།
en: If the vidyā holder wants to accomplish the eye ointment rite, he should remain ritually pure, bathe thoroughly, and maintain the purity of practice.

source: །ལྡོང་རོས་ཟངས་ཀྱི་སྣོད་དུ་གཞག་པར་བགྱི་སྟེ། རས་རིས་ལ་མངོན་དུ་ཕྱོགས་ནས་སྐྱིལ་མོ་ཀྲུང་གིས་འདུག་སྟེ། ཚེས་བརྒྱད་དམ་བཅོ་ལྔ་ལ་ཉིན་མཚན་དུ་སྨྱུང་བར་གནས་པས་ཨ་ཤྭཏྠའི་འདབ་མ་བཞི་ཡིས་དག་པར་བགྱི་སྟེ། ཇི་སྲིད་དུ་དངོས་གྲུབ་རྣམ་པ་གསུམ་དྲོ་བར་བགྱིད་པ་དང་། དུ་བ་འཐུལ་བར་བགྱིད་པ་དང་།
en: On the eighth or the fifteenth day of the lunar fortnight, after fasting for one day and one night, he should place some realgar in a copper container and sit down facing the cloth painting in a cross-legged position.

source: འབར་བར་བགྱིད་པ་དེ་སྲིད་དུ་བཟླས་པ་བགྱིའོ།
en: He should cover the container with four leaves from a bodhi tree and recite the mantra until one of the three signs of accomplishment appears—the realgar gets hot, emits smoke, or bursts into flames. “

source: །དྲོ་བར་གྱུར་པ་འདིས་མིག་ལ་བྱུགས་པས་གང་མཐོང་བ་དེ་དབང་དུ་འགྱུར་རོ།
en: If the realgar gets hot, anyone who sees the vidyā holder who anointed his eyes with it will fall under his thrall.

source: །གང་བླངས་པ་དེ་རྙེད་དོ། །འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་མཆོད་པའི་འོས་ཆེན་པོར་འགྱུར་རོ།
en: He will thus obtain whatever he asks for and be venerated by the entire world.

source: །རྒྱལ་པོ་དང་། རྒྱལ་པོའི་བློན་པོ་དང་། བཙུན་མོའི་འཁོར་དང་བཅས་པ་ཐམས་ཅད་ཀྱི་མཆོད་པ་བྱ་བའི་འོས་སུ་འགྱུར་ཏེ། སྤྱི་བོར་འཇོག་པར་འགྱུར་རོ།
en: He will be worshiped, venerated, and honored by the king, the royal ministers, and the king’s harem and retinue, who will all place him above their heads.

source: །དུ་བ་འཐུལ་བ་འདིས་མིག་ལ་བྱུགས་པས། སོར་མོ་བཅུའི་ཚད་ཀྱི་ས་གཞི་ལ་རྐང་པས་རེག་པས་དཔག་ཚད་སྟོང་ཕྲག་ཏུ་སོང་ནས། སླར་ཡང་འོང་བར་བྱེད་དོ།
en: If the realgar emits smoke, the vidyā holder who anoints his eyes with it will be able to walk one thousand leagues and back again without touching the ground; he will remain ten fingers above the ground.

source: །དཔག་ཚད་སྟོང་ཕྲག་ཏུ་ཉན་པར་བྱེད་དོ། །དཔག་ཚད་སྟོང་ཕྲག་ཏུ་ལྟ་བར་བྱེད་དོ།
en: He will also be able to hear sounds from a distance of one thousand leagues and see things at the same distance.

source: །ལོ་སྟོང་ཕྲག་བཅུ་གསུམ་དུ་འཚོ་བར་བྱེད་དོ། །སུ་གང་གིས་ཀྱང་བཀའ་བསྒོ་བར་བྱེད་པར་མི་འགྱུར་རོ། །རྟག་ཏུ་བདེ་བ་དང་བཅས་པ་ཡང་དག་པར་ཐོབ་པ་དང་། རྟག་ཏུ་བླ་མའི་གནས་སུ་བྱ་བར་འགྱུར་རོ།
en: He will live thirteen thousand years, will never have to follow anyone’s orders, will always be happy, and will enjoy the position of a respected teacher.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལྷག་པར་མཐོང་བར་འགྱུར་རོ།
en: All the tathāgatas will always look after him.

source: །འབར་བས་ནི་བདག་ཉིད་གཉིས་ཏེ། འཕུར་བར་བྱེད་པ་དང་ལོ་སྟོང་ཕྲག་བཅུར་འཚོ་བར་བྱེད་དོ།
en: If the realgar bursts into flames, the vidyā holder will fly up into space in the company of Noble Avalokiteśvara and live ten thousand years. “

source: །དེ་ནས་ལྡོང་རོས་ཀྱི་སྒྲུབ་པ་གཞན་ནི་འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པའི་སྒྲུབ་བར་བྱེད་པའོ། །དེ་ནས་ཀ་ར་བཱི་ར་དང་།
en: The vidyā holder who performs rites involving realgar can, in addition, perform other practices both worldly and supramundane.

source: ལྡོང་རོས་དཔའ་བོའི་རིན་གྱིས་བླངས་ནས་སྦྱོང་དུ་གཞུག་པར་བགྱི་ཞིང་བ་བྱུང་ལྔས་ཡང་དག་པར་སྦྱངས་ནས།
en: He should procure oleander flowers and realgar by honest means, purify them, and mix them with the five products of the cow.

source: རྫོགས་པ་ལ་ཞག་གསུམ་དུ་སྨྱད་བར་གནས་པས་བཅོམ་ལྡན་འདས་དང་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་མཆོད་པ་རྒྱ་ཆེན་པོ་བྱས་ནས།
en: After fasting for three days, he should make large offerings to the Blessed One and to Noble Avalokiteśvara on the day of the full moon.

source: པདྨའི་འདབ་མ་བཞི་རྣམས་ཀྱིས་ལྡོང་རོས་ལ་རབ་ཏུ་བཀོད་ནས། གསུམ་གྱིས་ཀུན་ཏུ་གཡོགས་ཏེ། ཇི་སྲིད་དུ་དངོས་གྲུབ་རྣམ་པ་གསུམ་དྲོ་བར་བྱེད་པ་དང་། དུ་བ་འཐུལ་བར་བྱེད་པ་དང་། འབར་བར་བྱེད་པ་དེ་སྲིད་དུ་བཟླས་པར་བྱའོ།
en: He should place the realgar upon four lotus leaves, cover it with another three, and recite the mantra until one of the three signs of accomplishment appears—the realgar gets hot, emits smoke, or bursts into flames. “

source: །དྲོ་བར་བྱེད་བཞིན་པས་ནི་ཐིག་ལེ་བྱས་ནས།
en: He should then use the realgar to mark a bindi between his eyebrows.

source: ཇི་སྲིད་དུ་སེམས་ཅན་མཐོང་བ་དང་། གང་གིས་བལྟ་བ་དེ་ཐམས་ཅད་དབང་དུ་འགྱུར་རོ།
en: If he does this with realgar that became hot, all the beings he sees or who see him will fall under his thrall, even animals.

source: །དུད་འགྲོའི་སྐྱེ་གནས་སུ་སོང་བ་ཚེ་མེད་པ་ཡང་ཚེ་ཉིས་འགྱུར་དུ་འཕེལ་བར་འགྱུར་རོ།
en: Their lifespan will double.

source: །དུ་བ་འཐུལ་བཞིན་པས་ནི་ཐིག་ལེ་བྱས་པས་རིགས་བཞིའི་འཇིག་རྟེན་ཐམས་ཅད་དེའི་དབང་དུ་འགྱུར་རོ།
en: If he makes a bindi with the realgar that emits smoke, the people of all four castes will fall under his thrall.

source: །སྐྱེས་བུ་ཙམ་གྱིས་གཞི་ལ་རྐང་པས་རེག་པས་དཔག་ཚད་སྟོང་ཕྲག་གསུམ་མཐོང་ངོ་། །དཔག་ཚད་སྟོང་ཕྲག་གསུམ་ནས་ཉན་པར་བྱེད་དོ།
en: He will be able to walk with his feet off the ground at the height of a man, see objects at a distance of three thousand leagues, and hear sounds from the same distance.

source: །ལོ་སྟོང་ཕྲག་བཅུ་གཉིས་སུ་འཚོ་བར་འགྱུར་རོ།
en: He will live twelve thousand years.

source: །འབར་བར་བྱེད་པས་ནི་ཐིག་ལེ་བྱས་པས་ནམ་མཁའ་ལ་འགྲོ་བར་འགྱུར་རོ། །ལན་གྲངས་ཉི་ཤུར་འཕུར་བར་བྱེད་དོ།
en: If he makes a bindi with the realgar that emits flames, he will be able to travel through space, flying with a retinue of twenty.

source: །ལྡོང་རོས་ཀྱི་དངོས་གྲུབ་ཐམས་ཅད་ཀྱི་རྒྱལ་པོར་འགྱུར་རོ།
en: He will become the king of all those who mastered the magic of realgar.

source: །དཔག་ཚད་སྟོང་ཕྲག་གསུམ་དུ་འཕུར་བར་བྱེད་དོ། །ལོ་སྟོང་ཕྲག་བརྒྱད་ཅུར་འཚོ་བར་བྱེད་དོ།
en: He will ascend to a height of three thousand leagues and will live eighty thousand years. “

source: །གི་ཝང་སྒྲུབ་པར་འདོད་པས་བ་སེར་སྐྱའི་མར་གྱིས་གི་ཝང་ཡང་དག་པར་སྦྱངས་ཏེ།
en: If the vidyā holder wants to accomplish rites involving bovine bezoar, he should purify the bezoar with the ghee from a tawny cow.

source: དཀར་པོའི་བཅོ་ལྔའམ་བརྒྱད་ལ་མཚན་མོ་གསུམ་དུ་སྨྱུང་བར་གནས་པས། བཅོམ་ལྡན་འདས་དང་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་མཆོད་པ་རྒྱ་ཆེན་པོ་བྱས་ནས་རབ་ཏུ་བཀོད་དེ།
en: On the eighth or the fifteenth day of the bright fortnight, after fasting for three days, he should make large offerings to the Blessed One and to Noble Avalokiteśvara.

source: ལག་པ་གཡས་པས་མནན་ནས་ཇི་སྲིད་དུ་དངོས་གྲུབ་རྣམ་པ་གསུམ་དུ་གྱུར་པ་དེ་སྲིད་དུ་བཟླས་པར་བྱའོ།
en: He should place the bezoar on the palm of his right hand and, propping it up, recite the mantra until one of the three signs of accomplishment appears. “

source: །དྲོ་བར་བྱེད་བཞིན་པས་ནི་ཐིག་ལེ་བྱས་པས་གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། ཡི་དགས་དང་། ཤ་ཟ་དང་། འབྱུང་པོ་རྣམས་ཀྱིས་དེ་ལ་རི་མོར་བྱེད་དོ།
en: If he marks his forehead with the bezoar that has become hot, he will bring under his control yakṣas, rākṣasas, pretas, piśācas, and bhūtas, who will provide for him anything he seeks.

source: །གང་བླངས་པ་དེ་སྟེར་རོ། །ཉི་མ་དེ་ནས་བརྩམས་ཏེ་ཚེ་ལོ་སྟོང་ཕྲག་ལྔར་འགྱུར་རོ།
en: He will live, from that day onward, another five thousand years.
